# import xlrd
#
# fname = "data.xls"
# bk = xlrd.open_workbook(fname)
# shxrange = range(bk.nsheets)
# try:
#     sh = bk.sheet_by_name("Sheet2")
# except:
#     print
#     "no sheet in %s named Sheet1" % fname
# # 获取行数
# nrows = sh.nrows
# # 获取列数
# ncols = sh.ncols
# print ("nrows %d, ncols %d" % (nrows, ncols))
# # 获取第一行第一列数据
# cell_value = sh.cell_value(1, 1)
# # print cell_value
#
# row_list = []
# # 获取各行数据
# for i in range(1, nrows):
#     row_data = sh.row_values(i)
#     row_list.append(row_data)
# print(row_list)
#= -*- coding: utf-8 -*-
from efficient_apriori import apriori
import pandas as pd

transactions = [['高7'], ['高4', '中7'], ['高1', '高2', '中3', '高4', '中6', '中7'],
                ['低2', '中3', '高4'], ['中1', '中2', '中3', '高4',  '中7'],
                ['高1', '低2', '高3', '高4'], ['高1'],  ['低1', '中2', '低3', '高4','中7'], ['高2', '中3', '中4', '高7'], ['高7'],
                ['中2', '中4'],
                ['高1', '低2', '低3', '中4', '高5', '低7'], ['高2', '高3', '中7'], ['低2', '低3', '高7'], ['中1', '高7'], ['高1'],
                ['高1'], ['中3', '高5', '中7'],
                ['中2', '高6', '中7'], ['高7'], ['低1', '高7'], ['高1', '高2', '中3', '中4', '中7'], ['低1', '中2', '高4', '低7'],
                ['低1', '低2','高7'],
                ['高2','高7'], ['高7'], ['中1', '高2', '中3', '高4','中7'], ['高5'],
                ['中1', '高2', '高3', '中7'], ['中1', '高2', '高3','中7'],
                ['中1', '中2', '高3','高7'], ['高1', '高2', '高3'], ['高7'], ['高7'], ['高2', '中3','低7'],
                ['中1', '中2', '高3','中6', '低7'],['中2', '高3','中7'],
                ['中1', '高2', '高3','中6', '中7'], ['高1', '中2', '高3', '中7'], ['高1', '中2', '中3'], ['高7'], ['高7'], ['高1', '中2', '中4','中7'],
                ['中1', '低3', '低4', '高5', '低6', '低7'],['中1', '低2', '中4', '高5'], ['中1', '中2', '高3', '中4', '高6', '中7'],
                ['中2', '低3','高7'],
                ['中1', '中2', '中3', '高4'], ['高2', '低7'], ['低1', '中2', '高3','中7'], ['中1', '中2', '中3', '中4','高6', '高7'],
                ['高2'], ['低1','中4','高6'],
                ['低1', '中2', '低3','高6', '中7'], ['低1', '高2','中7'], ['中1', '中2', '高3'], ['高2', '中3','低7'],
                ['低1', '高2', '高3', '中6', '中7'], ['高6', '中7'],
                ['高1', '低2', '中3', '高6', '中7'], ['高1', '中3', '高7'], ['低2', '低3','高6'], ['高5'], ['高2'],
                ['高5', '低7'], ['中1', '低2', '中3', '高4','中7'],
                ['高3'], ['中1', '中2', '高3', '高4','中7'], ['高1', '高2'], ['中2', '低3','高6'], ['高7']]
print(transactions)
itemsets, rules = apriori(transactions, min_support=0.15,  min_confidence=0.5)
print(itemsets)
print(rules)
